#--------------greek_dictionary.py--------------#
"""Στο αρχείο αυτό βρίσκεται το λεξικό που περιλαμβάνει 50 λέξεις σε μία λίστα, από αυτές που θα επιλέγονται σε κάθε γύρο
του παιχνιδιού,καθώς και όλα τα αποδεκτά γράμματα που μπορει να δώσει ως επιλογή ο χρήστης και κάποιες συναρτήσεις που
διαμορφώνουν την τυχαία επιλογή λέξης"""

#Όλες οι πιθανές λέξεις ενός παιχνιδιού "Κρεμάλας".
dictionary=['κτίρια','νύχτα','αγόρι','θάλασσα','ήλιος','δεινόσαυρος',\
	    'ποίημα','ποτάμι','πίνακας','τσάντα',\
	    'ανέκδοτο','αλγόριθμος','κύμα','πορτοκάλι',\
	    'λουλούδι','ιδέα','βουνό','αστυνομία',\
	    'ήπειρος','δάχτυλο','κάρβουνο','σκοτάδι',\
	    'γραμμή','χάρτης','λόφος','βάρκα','φύλλο',\
	    'θρανείο','υπολογιστής','κασετόφωνο','περιοδικό',\
	    'θερμοκήπειο','ακροβατικό','ταινία','πηγάδι',\
	    'ουρανός','γραμμή','πολυώνυμο','σκουπίδι',\
            'ποδήλατο','αετός','καρχαρίας','μεσημέρι',\
	    'μαλλιά','βόμβα','προγραμματισμός','ρόδι',\
            'βαμβάκι','αεροπλάνο','μουσική']

#Τα ελληνικά φωνήεντα σε μικρά,κεφαλαία,με τόνους και χωρίς τόνους.

vowels=['α','ά','η','ή','ι','ί','ο','ό','υ','ύ','ε','έ','ω','ώ']
upper_vowels=['Α', 'Η', 'Ι', 'Ο', 'Υ', 'Ε', 'Ω']            
upper_vowels_tone=['Ά', 'Ή', 'Ί', 'Ό', 'Ύ', 'Έ', 'Ώ']

#Τα ελληνικά σύμφωνα σε μικρά και κεφαλαία.

consonants=['β','γ','δ','ζ','θ','κ','λ','μ','ν','ξ','π','ρ','σ','ς','τ','φ','χ','ψ','ω']
upper_consonants=['Β', 'Γ', 'Δ', 'Ζ', 'Θ', 'Κ', 'Λ', 'Μ', 'Ν', 'Ξ', 'Π', 'Ρ','Σ', 'Τ', 'Φ', 'Χ', 'Ψ', 'Ω']

"""Η παρακάτω εντολή δημιουργεί μια μεγάλη λίστα που περιλαμβάνει όλα τα στοιχεια των παραπάνω λιστών μαζί"""
acceptable_letters=vowels+ upper_vowels+upper_vowels_tone+consonants+upper_consonants


def pick_random_word(last_2_words):
    """ Η συνάρτηση αυτή επιστρέφει μία λέξη απο το λεξικό η οποία δέν έχει ξανα χρησιμοποιηθεί τους 2 τελευταίους γύρους"""
    import random
    rand_word=dictionary[random.randrange(len(dictionary))]
    while rand_word in last_2_words:
        rand_word=dictionary[random.randrange(len(dictionary))]
    return rand_word

def used_words_update(new_word,last_2_used_words):
    """ H συνάρτηση αυτή επιστρέφει μία νέα λίστα η οποία ανανεώνει την προηγούμενη προσθέτοντας μία καινούργια λέξη.

    >>> lista=['hello','world']
    >>> used_words_update('goodbye',lista)
    ['world', 'goodbye']
    """
    if last_2_used_words[0]=='':
        last_2_used_words[0]=new_word
    elif last_2_used_words[0]!='' and last_2_used_words[1]=='':
        last_2_used_words[1]=new_word
    else:
        last_2_used_words[0]=last_2_used_words[1]
        last_2_used_words[1]=new_word
    return last_2_used_words
        
def print_hidden(hidden_letters):
    """ H συνάρτηση δέχεται σαν όρισμα τη λίστα με την κρυμμένη λέξη και την εκτυπώνει ως εξής:

    >>> hidden_word=['_','α','_','_','ς']
    >>> print_hidden(hidden_word)
    Η λέξη που πρέπει να μαντέψεις είναι: _ α _ _ ς 
    >>>
    """
    print('Η λέξη που πρέπει να μαντέψεις είναι: ',end='')
    for letter in hidden_letters:
        print(letter+' ',end='')
    print('\n')           
