#--------------------- inputs.py---------------------#
"""Στο αρχειο αυτό βρίσκονται όλες οι συναρτήσεις με τις οποίες κάνουν οι χρήστες
είσοδο των δεδομένων τους"""

def get_number():
    """Η συνάρτηση ελέγχει πως ο χρήστης θα πληκτρολογήσει αποδεκτή τιμή
    για το πλήθος των παιχτών του παιχνιδιού, και όχι κάποια λάθος όπως θα
    ηταν το 0 ή -5 ή 5,6 ή το string 'hello'.Έπειτα επιστρέφει το πλήθος. Πρέπει να έχει το ακόλουθο
    αποτέλεσμα:
    
    >>> get_number()
    Αριθμός παιχτών που θα παίξουν: 0
    Λάθος είσοδος δεδομένων!
    Ο αριθμός των παιχτών πρέπει να ειναι θετικός και ακέραιος!
    Αριθμός παιχτών που θα παίξουν: 3.5
    Λάθος είσοδος δεδομένων!
    Ο αριθμός των παιχτών πρέπει να ειναι θετικός και ακέραιος!
    Αριθμός παιχτών που θα παίξουν: three
    Λάθος είσοδος δεδομένων!
    Ο αριθμός των παιχτών πρέπει να ειναι θετικός και ακέραιος!
    Αριθμός παιχτών που θα παίξουν: 3
    3
    """
    ready=False
    while ready!=True:
        x=input('Αριθμός παιχτών που θα παίξουν: ')
        if x.isdigit():
            if int(x)>=1:
                ready=True
        if ready==False:
            print('Λάθος είσοδος δεδομένων!')
            print ('Ο αριθμός των παιχτών πρέπει να ειναι θετικός και ακέραιος!')
    return int(x)

def get_names(x):
    """ Η συνάρτηση ζητάει από τους παίχτες να γράψουν τα ονόμα τους στο πληκτρολόγιο και έπειτα τα καταχωρει
    σε μία λίστα. Για παράδειγμα:
    
    >>> get_names(2)
    Ποιο είναι το όνομα του 1oυ παίχτη; George
    Ποιο είναι το όνομα του 2oυ παίχτη; Nick
    ['George', 'Nick']
    """
    name_list=[]
    for i in range(0,x):
        name=input('Ποιο είναι το όνομα του '+str(i+1)+'oυ παίχτη; ')
        name_list.append(name)
    return name_list

def get_difficulty():
    """ H συνάρτηση ζητάει απο το χρήστη να πληκτρολογήσει έναν αριθμό από τους 1,2 και 3, το οποίο θα αντιπροσωπεύει τη δυσκολία
με την οποία θέλει να παίξει ο παίχτης κρεμάλα, περισσότερη δυσκολία σημαινεί λιγότερες ζωές στο παιχνίδι. Επιστρέφει ως string
τη δυσκολία όπως στο παρακάτω παράδειγμα:

    >>> get_difficulty()
    Διάλεξε το βαθμό δυσκολίας σου!
    1.Αρχάριος - 8 ζωές
    2.Μέτριος - 6 ζωές
    3.Έμπειρος - 4 ζωές
    Γράψε 1 ή 2 ή 3: 0
    Κάτι πήγε στραβά. Ξανά προσπάθησε.
    Γράψε 1 ή 2 ή 3: 2
    'Έμπειρος'
    """
    print('Διάλεξε το βαθμό δυσκολίας σου!')
    print('1.Αρχάριος - 8 ζωές')
    print('2.Μέτριος - 6 ζωές')
    print('3.Έμπειρος - 4 ζωές')
    difficulty=input('Γράψε 1 ή 2 ή 3: ')
    while difficulty!='1' and difficulty!='2' and difficulty!='3':
        print('Κάτι πήγε στραβά. Ξανά προσπάθησε.')
        difficulty=input('Γράψε 1 ή 2 ή 3: ')
    if difficulty=='1':
        return 'Αρχάριος'
    elif difficulty=='2':
        return 'Μέτριος'
    else:
        return 'Έμπειρος'

def get_guess():
    """ H συνάρτηση αυτή φροντίζει ο χρήστης να δώσει ένα γράμμα της ελληνικής γλώσσας, και όχι οτιδήποτε άλλο και σε
περίπτωη που δώσει κεφαλάιο τότε η συνάρτηση επιστρέφει το μικρό του.

    >>> get_guess()
    Δώσε γράμμα: g
    Αυτό που μου έδωσες δεν ειναι γράμμα της ελληνικής γλώσσας!
    Προσπάθησε ξανά.
    Δώσε γράμμα: Δ
    'δ'
    """
    from greek_dictionary import acceptable_letters
    guessed_letter=input('Δώσε γράμμα: ')
    while guessed_letter not in acceptable_letters:
        print('Αυτό που μου έδωσες δεν ειναι γράμμα της ελληνικής γλώσσας!\nΠροσπάθησε ξανά.')
        guessed_letter=input('Δώσε γράμμα: ')
    if guessed_letter=='ς': #Ακραία περίπτωση συμφώνου
        return 'σ'
    else:
        return guessed_letter.lower()
